--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/teparlett/Documents/Data Management and Research Life Cycle/Final 
> Project/Isolating Variables/mediaincome.2017.ACS5.cleaning.log
  log type:  text
 opened on:   5 May 2019, 13:19:13

. 
. import delimited "/Users/teparlett/Documents/Data Management and Research Life Cycle
> /Final Project/Raw Data/medianincome.2017.ACS5.raw.csv"
(243 vars, 3,144 obs)

. drop v1

. drop v3

. rename v2 GEOID

. drop v4-v7

. drop v9-v243

. rename v8 median_household_income

. drop in 1/2
(2 observations deleted)

. save "/Users/teparlett/Documents/Data Management and Research Life Cycle/Final Proje
> ct/Isolated Variables/medianincome.2017.ACS5.cleaned.dta"
file /Users/teparlett/Documents/Data Management and Research Life Cycle/Final Project/
> Isolated Variables/medianincome.2017.ACS5.cleaned.dta saved

. log close
      name:  <unnamed>
       log:  /Users/teparlett/Documents/Data Management and Research Life Cycle/Final 
> Project/Isolating Variables/mediaincome.2017.ACS5.cleaning.log
  log type:  text
 closed on:   5 May 2019, 13:22:40
--------------------------------------------------------------------------------------
