---------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/teparlett/Documents/Data Management and Research Life Cycle/Final Project/Cleaning 2/full.dataset.cleaning.log
  log type:  text
 opened on:   5 May 2019, 14:31:12

. sort n_RUCC_2013

. drop if n_RUCC_2013 < 4
(1,162 observations deleted)

. save "/Users/teparlett/Documents/Data Management and Research Life Cycle/Final Project/Final Datasets/nonmetro.dataset.dta"
file /Users/teparlett/Documents/Data Management and Research Life Cycle/Final Project/Final Datasets/nonmetro.dataset.dta saved

. drop if n_RUCC_2013 = 4
=exp not allowed
r(101);

. drop if n_RUCC_2013 ==4
(213 observations deleted)

. drop if n_RUCC_2013 == 6
(592 observations deleted)

. drop if n_RUCC_2013 == 8
(220 observations deleted)

. save "/Users/teparlett/Documents/Data Management and Research Life Cycle/Final Project/Final Datasets/nonmetro.nonadjacent.dataset.dta"
file /Users/teparlett/Documents/Data Management and Research Life Cycle/Final Project/Final Datasets/nonmetro.nonadjacent.dataset.dta saved

. log close
      name:  <unnamed>
       log:  /Users/teparlett/Documents/Data Management and Research Life Cycle/Final Project/Cleaning 2/full.dataset.cleaning.log
  log type:  text
 closed on:   5 May 2019, 14:35:35
---------------------------------------------------------------------------------------------------------------------------------------------------------
